[
  {
    "imageId": 1,
    "heroName": "ABADDON\n",
    "heroDescription": "SHIELDS HIS ALLIES OR HIMSELF FROM ATTACKS",
    "heroHistory": "Able to transform enemy attacks into self-healing, Abaddon can survive almost any assault. Shielding allies and launching his double-edged coil at a friend or foe, he is always ready to ride into the thick of battle.",
    "typeImage": 1,
    "heroType": "Strength",
    "attackTypeImage": 1,
    "attackType": "MELEE",
    "complexityImage": 1,
    "roleCarry": 25,
    "roleSupport": 75,
    "roleNuker": 0,
    "roleDisabler": 0,
    "roleJungler": 0,
    "roleDurable": 75,
    "roleEscape": 0,
    "rolePusher": 0,
    "roleInitiator": 0,
    "statMovementSpeed":"325",
    "statAttackDamage": "50-60",
    "statVision": "1800/800",
    "statAttackTime": "1.7",
    "statArmor": "2.8",
    "statAttackRange": "150",
    "attributeStrength": "22 +2.6",
    "attributeAgility": "23 +1.5",
    "attributeIntelligence": "18 +2.0",
    "skillName1": "MIST COIL",
    "skillName1Cd": "5.5",
    "skillName1Mana": "50",
    "skillName1Description": "Abaddon releases a coil of deathly mist that can damage an enemy unit or heal a friendly unit at the cost of some of Abaddon's health.",
    "skillName2": "APHOTIC SHIELD",
    "skillName2Cd": "12/10/8/6",
    "skillName2Mana": "85/100/115/130",
    "skillName2Description": "Summons dark energies around an ally unit, creating a shield that absorbs a set amount of damage before expiring. When the shield is destroyed it will burst and deal damage equal to the amount it could absorb to an area around it. Removes certain types of negative buffs and stuns on cast.",
    "skillName3": "CURSE OF AVERNUS",
    "skillName3Cd": "0",
    "skillName3Mana": "0",
    "skillName3Description": "Abaddon strikes an enemy, slowing the target's movement speed. If the target gets hit 4.0 times, they become affected by a chilling curse causing them to be silenced and slowed, and all attacks against them gain an attack speed boost.",
    "skillNameExtra": "",
    "skillNameExtraCd":  "",
    "skillNameExtraMana": "",
    "skillNameExtraDescription": "",
    "skillName4": "BORROWED TIME",
    "skillName4Cd": "60/50/40",
    "skillName4Mana": "0/0/0",
    "skillName4Description": "When activated, all damage dealt to you will heal instead of harm. Most negative buffs will also be removed. If the ability is not on cooldown, it will automatically activate if your health falls below 400.0."
  },

  {
    "imageId": 2,
    "heroName": "ALCHEMIST\n",
    "heroDescription": "EARNS EXTRA GOLD FROM UNIT KILLS AND BOUNTY RUNES",
    "heroHistory": "Synthesizing extra resources from each and every kill, Alchemist has no trouble gathering the tools needed to destroy his foes. Ambushing enemies with corrosive acid and a host of unstable chemicals, he battles to ensure his greedy escapades can remain uninterrupted.",
    "typeImage": 1,
    "heroType": "Strength",
    "attackTypeImage":1 ,
    "attackType": "MELEE",
    "complexityImage": 1,
    "roleCarry": 75,
    "roleSupport": 25,
    "roleNuker": 25,
    "roleDisabler": 25,
    "roleJungler": 0,
    "roleDurable": 75,
    "roleEscape": 0,
    "rolePusher": 0,
    "roleInitiator": 25,
    "statMovementSpeed":"305",
    "statAttackDamage": "50-56",
    "statVision": "1800/800",
    "statAttackTime": "1.7",
    "statArmor": "2.7",
    "statAttackRange": "150",
    "attributeStrength": "23 +2.7",
    "attributeAgility": "22 +1.5",
    "attributeIntelligence": "25 +1.8",
    "skillName1": "ACID SPRAY",
    "skillName1Cd": "22",
    "skillName1Mana": "130/140/150/160",
    "skillName1Description": "Sprays high-pressure acid across a target area. Enemy units who step across the contaminated terrain take damage per second and have their armor reduced.",
    "skillName2": "UNSTABLE CONCOCTION",
    "skillName2Cd": "13",
    "skillName2Mana": "100",
    "skillName2Description": "Alchemist brews up an unstable concoction that he can throw at an enemy hero, to stun and deal damage in an area around the explosion. The longer the concoction brews, the more damage it deals and the longer the stun. Alchemist is faster while charging the concoction. After 5.0 seconds, the brew reaches its maximum damage and stun time. However, after 5.5 seconds, the concoction will explode on Alchemist himself if not thrown.",
    "skillName3": "GREEVIL'S GREED",
    "skillName3Cd": "0",
    "skillName3Mana": "0",
    "skillName3Description": "Alchemist synthesizes additional gold from his enemies and bounty runes. With each kill, Alchemist earns base bonus gold and extra bonus gold. If Alchemist kills another unit which yields gold within the next 36.0 seconds, an additional instance of Extra Bonus Gold is added to the total. Additionally, causes bounty runes to yield more gold.",
    "skillName4": "CHEMICAL RAGE",
    "skillName4Cd": "60",
    "skillName4Mana": "50/75/100",
    "skillName4Description": "Alchemist causes his Ogre to enter a chemically induced rage, reducing base attack cooldown and increasing movement speed and health regeneration."
  },

  {
    "imageId": 3,
    "heroName": "ANCIENT APPARITION",
    "heroDescription": "LAUNCHES A POWERFUL ICY BLAST FROM ANYWHERE ON THE MAP",
    "heroHistory": "Able to launch a powerful blast of damaging ice across the battlefield, Ancient Apparition threatens to shatter weakened enemies wherever they are. Slowing enemies as he enhances his allies' effectiveness in battle, he is a constant threat to his foes.",
    "typeImage": 3,
    "heroType": "Intelligence",
    "attackTypeImage": 2,
    "attackType": "RANGE",
    "complexityImage": 2,
    "roleCarry": 0,
    "roleSupport": 75,
    "roleNuker": 25,
    "roleDisabler": 25,
    "roleJungler": 0,
    "roleDurable": 0,
    "roleEscape": 0,
    "rolePusher": 0,
    "roleInitiator": 0,
    "statMovementSpeed":"285",
    "statAttackDamage": "44-54",
    "statVision": "1800/800",
    "statAttackTime": "1.7",
    "statArmor": "2.3",
    "statAttackRange": "675",
    "attributeStrength": "20 +1.9",
    "attributeAgility": "20 +2.2",
    "attributeIntelligence": "23 +3.4",
    "skillName1": "COLD FEET",
    "skillName1Cd": "12/11/10/9",
    "skillName1Mana": "125",
    "skillName1Description": "Places a frozen hex on an enemy unit that deals damage over time, but can be dispelled by moving away from the initial cast point.  If the enemy unit doesn't move outside of the given range, it will be stunned and frozen in place after 4 seconds.",
    "skillName2": "ICE VORTEX",
    "skillName2Cd": "7/6/5/4",
    "skillName2Mana": "40/50/60/70",
    "skillName2Description": "Creates a vortex of icy energy that slows and increases magic damage done to enemies in its range.",
    "skillName3": "CHILLING TOUCH",
    "skillName3Cd": "12/9/6/3",
    "skillName3Mana": "30/40/50/60",
    "skillName3Description": "Enhances Ancient Apparition's attack with increased range, heavy magic damage, and movement slow.",
    "skillName4": "ICE BLAST",
    "skillName4Cd": "60/50/40",
    "skillName4Mana": "175",
    "skillName4Description": "Launches a tracer toward any location on the battlefield, which must be triggered again to mark the area to be blasted by a damaging explosion of hail. The further the tracer travels, the larger the explosion will be. Enemies caught in the explosion, or who touch the icy ball of hail as it travels, are Frostbitten, taking damage and prevented from regenerating or healing. If a Frostbitten unit's health drops below a certain percentage, they will instantly shatter."
  },

  {
    "imageId": 4,
    "heroName": "ANTI-MAGE\n",
    "heroDescription": "SLASHES HIS FOES WITH MANA-DRAINING ATTACKS",
    "heroHistory": "Should Anti-Mage have the opportunity to gather his full strength, few can stop his assaults. Draining mana from enemies with every strike or teleporting short distances to escape an ambush, cornering him is a challenge for any foe.",
    "typeImage": 2,
    "heroType": "Agility",
    "attackTypeImage": 1,
    "attackType": "MELEE",
    "complexityImage": 1,
    "roleCarry": 100,
    "roleSupport": 0,
    "roleNuker": 25,
    "roleDisabler": 0,
    "roleJungler": 0,
    "roleDurable": 0,
    "roleEscape": 100,
    "rolePusher": 0,
    "roleInitiator": 0,
    "statMovementSpeed":"310",
    "statAttackDamage": "53-57",
    "statVision": "1800/800",
    "statAttackTime": "1.4",
    "statArmor": "4.0",
    "statAttackRange": "150",
    "attributeStrength": "21 +1.6",
    "attributeAgility": "24 +2.8",
    "attributeIntelligence": "12 +1.8",
    "skillName1": "MANA BREAK",
    "skillName1Cd": "0",
    "skillName1Mana": "0",
    "skillName1Description": "Burns an opponent's mana on each attack and deals damage equal to a percentage of the mana burnt. Enemies with no mana left are temporarily slowed.",
    "skillName2": "BLINK",
    "skillName2Cd": "12/10/8/6",
    "skillName2Mana": "45",
    "skillName2Description": "Short distance teleportation that allows Anti-Mage to move in and out of combat.",
    "skillName3": "COUNTERSPELL",
    "skillName3Cd": "15/11/7/3",
    "skillName3Mana": "45",
    "skillName3Description": "Passively grants magic resistance. Counterspell may be activated to create an anti-magic shell around Anti-Mage that blocks and sends any targeted spells back towards enemies instead.",
    "skillName4": "MANA VOID",
    "skillName4Cd": "70",
    "skillName4Mana": "100/200/300",
    "skillName4Description": "For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies.  The main target is also mini-stunned."
  },

  {
    "imageId": 5,
    "heroName": "ARC WARDEN\n",
    "heroDescription": "CREATES A COPY OF HIMSELF TO SPLIT PUSH",
    "heroHistory": "A splintered fragment of the same primordial power as the Ancients themselves, Zet the Arc Warden has pledged to see the clash between Radiant and Dire finally end. Assault lone enemies with fluxing energy, or distort space to generate a protective field around allies. Summon a Spark Wraith to patrol an area for enemies to infuse with harmful magic, then create a double of Zet, items and all, to overwhelm your foes.",
    "typeImage": 2,
    "heroType": "Agility",
    "attackTypeImage": 2,
    "attackType": "RANGE",
    "complexityImage": 3,
    "roleCarry": 100,
    "roleSupport": 0,
    "roleNuker": 25,
    "roleDisabler": 0,
    "roleJungler": 0,
    "roleDurable": 0,
    "roleEscape": 100,
    "rolePusher": 0,
    "roleInitiator": 0,
    "statMovementSpeed":"285",
    "statAttackDamage": "51-57",
    "statVision": "1800/800",
    "statAttackTime": "1.7",
    "statArmor": "2.3",
    "statAttackRange": "625",
    "attributeStrength": "22 +2.6",
    "attributeAgility": "20 +3.0",
    "attributeIntelligence": "24 +2.6",
    "skillName1": "FLUX",
    "skillName1Cd": "16",
    "skillName1Mana": "75",
    "skillName1Description": "Infuses a lone enemy unit with swirling, volatile energy, slowing its movement speed and dealing damage over time. The damage is not applied if another enemy unit is near the target.",
    "skillName2": "MAGNETIC FIELD",
    "skillName2Cd": "20",
    "skillName2Mana": "50/70/90/110",
    "skillName2Description": "Generates a circular distortion field of magnetic energy that grants bonus attack speed and protects allied heroes and buildings within it by evading attacks coming from outside the field.",
    "skillName3": "SPARK WRAITH",
    "skillName3Cd": "4/4/4/4",
    "skillName3Mana": "80",
    "skillName3Description": "Summons a Spark Wraith that slowly materializes and patrols a targeted area until an enemy comes within its range. Once a target has been found the wraith fuses with them, dealing magical damage and slowing the unit.",
    "skillName4": "TEMPEST DOUBLE",
    "skillName4Cd": "60/50/40",
    "skillName4Mana": "0",
    "skillName4Description": "Briefly refocusing its fractured elements into a single form, the Arc Warden is able to create a perfect electrical duplication of itself. The duplicate can use all of Arc Warden's current items and spells, except most consumables and items that drop on death. The duplicate has separate item and ability cooldowns.  The Tempest Double gives bounty gold to enemies when killed. The Tempest Double loses its sense of self if he is too far away from Arc Warden and deals less attack damage."
  },

  {
    "imageId": 6,
    "heroName": "AXE\n",
    "heroDescription": "TAUNTS AND FORCES ENEMIES TO ATTACK HIM",
    "heroHistory": "One after another, Axe cuts down his foes. Marching ahead of his team, he locks his enemies in battle then counters their blows with a deadly spin of his weapon. Slamming his culling blade through a weakened enemy, he is always charging onward.",
    "typeImage": 1,
    "heroType": "Strength",
    "attackTypeImage": 1,
    "attackType": "MELEE",
    "complexityImage": 1,
    "roleCarry": 25,
    "roleSupport": 0,
    "roleNuker": 0,
    "roleDisabler": 75,
    "roleJungler": 75,
    "roleDurable": 100,
    "roleEscape": 0,
    "rolePusher": 0,
    "roleInitiator": 100,
    "statMovementSpeed":"310",
    "statAttackDamage": "55-59",
    "statVision": "1800/800",
    "statAttackTime": "1.7",
    "statArmor": "2.3",
    "statAttackRange": "150",
    "attributeStrength": "25 +2.8",
    "attributeAgility": "20 +2.0",
    "attributeIntelligence": "18 +1.6",
    "skillName1": "BERSERKER'S CALL",
    "skillName1Cd": "17/15/13/11",
    "skillName1Mana": "80/90/100/110",
    "skillName1Description": "Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration.",
    "skillName2": "BATTLE HUNGER",
    "skillName2Cd": "20/15/10/5",
    "skillName2Mana": "50/60/70/80",
    "skillName2Description": "Enrages an enemy unit, causing it to take damage over time until it kills another unit or the duration ends. The damage is increased by a factor of Axe's armor. The enemy is also slowed as long as they are facing away from Axe.",
    "skillName3": "COUNTER HELIX",
    "skillName3Cd": "0.3",
    "skillName3Mana": "0",
    "skillName3Description": "When attacked, Axe has a chance to perform a helix counter attack, dealing pure damage to all nearby enemies.",
    "skillName4": "CULLING BLADE",
    "skillName4Cd": "100/85/70",
    "skillName4Mana": "100/125/150",
    "skillName4Description": "Axe spots a weakness and strikes, dealing pure damage. When an enemy hero is killed with Culling Blade, its cooldown is reset, Axe gains bonus armor permanently and all nearby allied units gain bonus movement speed. "
  },

  {
    "imageId": 7,
    "heroName": "BANE\n",
    "heroDescription": "PUTS HIS ENEMIES TO SLEEP, INCAPACITATING THEM",
    "heroHistory": "Bane brings terror to his enemies with his arsenal of disabling abilities. Whether trapping a foe within a contagious nightmare, or gripping an enemy in place, he gives allies all the time they need to slay their enemy.",
    "typeImage": 3,
    "heroType": "Intelligence",
    "attackTypeImage": 2,
    "attackType": "RANGE",
    "complexityImage": 2,
    "roleCarry": 0,
    "roleSupport": 75,
    "roleNuker": 25,
    "roleDisabler": 100,
    "roleJungler": 0,
    "roleDurable": 25,
    "roleEscape": 0,
    "rolePusher": 0,
    "roleInitiator": 0,
    "statMovementSpeed":"305",
    "statAttackDamage": "55-61",
    "statVision": "1800/1200",
    "statAttackTime": "1.7",
    "statArmor": "4.7",
    "statAttackRange": "400",
    "attributeStrength": "22 +2.5",
    "attributeAgility": "22 +2.5",
    "attributeIntelligence": "22 +2.5",
    "skillName1": "ENFEEBLE",
    "skillName1Cd": "28/21/14/7",
    "skillName1Mana": "40/50/60/70",
    "skillName1Description": "Lowers the enemy's total attack damage, cast range, and regeneration.",
    "skillName2": "BRAIN SAP",
    "skillName2Cd": "17/15/13/11",
    "skillName2Mana": "100/120/140/160",
    "skillName2Description": "Feasts on the vital energies of an enemy unit, healing Bane and dealing damage.",
    "skillName3": "NIGHTMARE",
    "skillName3Cd": "24/21/18/15",
    "skillName3Mana": "165",
    "skillName3Description": "Puts the target enemy or friendly Hero to sleep. Sleeping units are awakened when damaged. If the target was directly attacked, the Nightmare passes to the attacking unit. Bane can attack nightmared targets freely. Enemy Units take Pure Damage Per Second while in Nightmare.",
    "skillName4": "FIEND'S GRIP",
    "skillName4Cd": "120/110/100",
    "skillName4Mana": "200/300/400",
    "skillName4Description": "CHANNELED - Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every 0.5 seconds based on the unit's maximum mana."
  }
]